Revit 2026 API

# UIControlledApplicationLoadedApplications Property

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ExternalApplicationArray LoadedApplications { get; }
```
```vb
Public Overridable ReadOnly Property LoadedApplications As ExternalApplicationArray
	Get
```
```cpp
public:
virtual property ExternalApplicationArray^ LoadedApplications {
	ExternalApplicationArray^ get ();
}
```
```fsharp
abstract LoadedApplications : ExternalApplicationArray with get
override LoadedApplications : ExternalApplicationArray with get
```

#### Property Value

ExternalApplicationArray

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace